
## Terraform plan for environment: `dev`

**Commit:** c804d70d64f13feb19508fb79220ffd30e60068e


**API version:** 418eb0c
**CLI version:** 418eb0c
**Selfserve version:** 418eb0c
**Internal version:** 418eb0c

### Plan summary

`34 to add, 0 to change, 0 to destroy`

**🆕 Creates**

```tf
module.service.module.eventbridge.aws_scheduler_schedule.this["clean-up-variations"]
module.service.module.eventbridge.aws_scheduler_schedule.this["close-expired-windows"]
module.service.module.eventbridge.aws_scheduler_schedule.this["cns"]
module.service.module.eventbridge.aws_scheduler_schedule.this["company-profile-dlq"]
module.service.module.eventbridge.aws_scheduler_schedule.this["create-psv-licence-surrender-task"]
module.service.module.eventbridge.aws_scheduler_schedule.this["digital-continuation-reminders"]
module.service.module.eventbridge.aws_scheduler_schedule.this["duplicate-vehicle-warning"]
module.service.module.eventbridge.aws_scheduler_schedule.this["enqueue-ch-compare"]
module.service.module.eventbridge.aws_scheduler_schedule.this["expire-bus-registration"]
module.service.module.eventbridge.aws_scheduler_schedule.this["flag-urgent-tasks"]
module.service.module.eventbridge.aws_scheduler_schedule.this["inspection-request-email"]
module.service.module.eventbridge.aws_scheduler_schedule.this["interim-end-date-enforcement"]
module.service.module.eventbridge.aws_scheduler_schedule.this["international-goods-export"]
module.service.module.eventbridge.aws_scheduler_schedule.this["last-tm-letter"]
module.service.module.eventbridge.aws_scheduler_schedule.this["licence-status-rules"]
module.service.module.eventbridge.aws_scheduler_schedule.this["mark-expired-permits"]
module.service.module.eventbridge.aws_scheduler_schedule.this["process-company-profile"]
module.service.module.eventbridge.aws_scheduler_schedule.this["process-inbox"]
module.service.module.eventbridge.aws_scheduler_schedule.this["process-insolvency"]
module.service.module.eventbridge.aws_scheduler_schedule.this["process-insolvency-dlq"]
module.service.module.eventbridge.aws_scheduler_schedule.this["process-ntu"]
module.service.module.eventbridge.aws_scheduler_schedule.this["process-queue-community-licences"]
module.service.module.eventbridge.aws_scheduler_schedule.this["process-queue-disc-generation"]
module.service.module.eventbridge.aws_scheduler_schedule.this["process-queue-disc-print"]
module.service.module.eventbridge.aws_scheduler_schedule.this["process-queue-ecmt-accept"]
module.service.module.eventbridge.aws_scheduler_schedule.this["process-queue-general"]
module.service.module.eventbridge.aws_scheduler_schedule.this["process-queue-irhp-allocate"]
module.service.module.eventbridge.aws_scheduler_schedule.this["process-queue-permit-generation"]
module.service.module.eventbridge.aws_scheduler_schedule.this["process-queue-permit-print"]
module.service.module.eventbridge.aws_scheduler_schedule.this["process-queue-print"]
module.service.module.eventbridge.aws_scheduler_schedule.this["psv-operator-list-export"]
module.service.module.eventbridge.aws_scheduler_schedule.this["remove-read-audit"]
module.service.module.eventbridge.aws_scheduler_schedule.this["resolve-payments"]
module.service.module.eventbridge.aws_scheduler_schedule.this["transxchange-consumer"]
```


----

<details data-gh-workflow="dev-environment-plan"><summary>Show full plan</summary>

```tf


Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.service.module.eventbridge.aws_scheduler_schedule.this["clean-up-variations"] will be created
  + resource "aws_scheduler_schedule" "this" {
      + arn                          = (known after apply)
      + description                  = "Schedule for vol-app-dev-clean-up-variations"
      + group_name                   = (known after apply)
      + id                           = (known after apply)
      + name                         = "clean-up-variations-schedule"
      + name_prefix                  = (known after apply)
      + schedule_expression          = "cron(00 02 * * ? *)"
      + schedule_expression_timezone = "UTC"
      + state                        = "ENABLED"

      + flexible_time_window {
          + mode = "OFF"
        }

      + target {
          + arn      = "arn:aws:scheduler:::aws-sdk:batch:submitJob"
          + input    = jsonencode(
                {
                  + JobDefinition = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-clean-up-variations:3"
                  + JobName       = "vol-app-dev-clean-up-variations"
                  + JobQueue      = "arn:aws:batch:eu-west-1:054614622558:job-queue/vol-app-dev-default"
                }
            )
          + role_arn = "arn:aws:iam::054614622558:role/default"
        }
    }

  # module.service.module.eventbridge.aws_scheduler_schedule.this["close-expired-windows"] will be created
  + resource "aws_scheduler_schedule" "this" {
      + arn                          = (known after apply)
      + description                  = "Schedule for vol-app-dev-close-expired-windows"
      + group_name                   = (known after apply)
      + id                           = (known after apply)
      + name                         = "close-expired-windows-schedule"
      + name_prefix                  = (known after apply)
      + schedule_expression          = "cron(45 00 * * ? *)"
      + schedule_expression_timezone = "UTC"
      + state                        = "ENABLED"

      + flexible_time_window {
          + mode = "OFF"
        }

      + target {
          + arn      = "arn:aws:scheduler:::aws-sdk:batch:submitJob"
          + input    = jsonencode(
                {
                  + JobDefinition = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-close-expired-windows:3"
                  + JobName       = "vol-app-dev-close-expired-windows"
                  + JobQueue      = "arn:aws:batch:eu-west-1:054614622558:job-queue/vol-app-dev-default"
                }
            )
          + role_arn = "arn:aws:iam::054614622558:role/default"
        }
    }

  # module.service.module.eventbridge.aws_scheduler_schedule.this["cns"] will be created
  + resource "aws_scheduler_schedule" "this" {
      + arn                          = (known after apply)
      + description                  = "Schedule for vol-app-dev-cns"
      + group_name                   = (known after apply)
      + id                           = (known after apply)
      + name                         = "cns-schedule"
      + name_prefix                  = (known after apply)
      + schedule_expression          = "cron(30 18 ? * 7 *)"
      + schedule_expression_timezone = "UTC"
      + state                        = "ENABLED"

      + flexible_time_window {
          + mode = "OFF"
        }

      + target {
          + arn      = "arn:aws:scheduler:::aws-sdk:batch:submitJob"
          + input    = jsonencode(
                {
                  + JobDefinition = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-cns:3"
                  + JobName       = "vol-app-dev-cns"
                  + JobQueue      = "arn:aws:batch:eu-west-1:054614622558:job-queue/vol-app-dev-default"
                }
            )
          + role_arn = "arn:aws:iam::054614622558:role/default"
        }
    }

  # module.service.module.eventbridge.aws_scheduler_schedule.this["company-profile-dlq"] will be created
  + resource "aws_scheduler_schedule" "this" {
      + arn                          = (known after apply)
      + description                  = "Schedule for vol-app-dev-company-profile-dlq"
      + group_name                   = (known after apply)
      + id                           = (known after apply)
      + name                         = "company-profile-dlq-schedule"
      + name_prefix                  = (known after apply)
      + schedule_expression          = "cron(0/30 * * * ? *)"
      + schedule_expression_timezone = "UTC"
      + state                        = "ENABLED"

      + flexible_time_window {
          + mode = "OFF"
        }

      + target {
          + arn      = "arn:aws:scheduler:::aws-sdk:batch:submitJob"
          + input    = jsonencode(
                {
                  + JobDefinition = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-company-profile-dlq:3"
                  + JobName       = "vol-app-dev-company-profile-dlq"
                  + JobQueue      = "arn:aws:batch:eu-west-1:054614622558:job-queue/vol-app-dev-default"
                }
            )
          + role_arn = "arn:aws:iam::054614622558:role/default"
        }
    }

  # module.service.module.eventbridge.aws_scheduler_schedule.this["create-psv-licence-surrender-task"] will be created
  + resource "aws_scheduler_schedule" "this" {
      + arn                          = (known after apply)
      + description                  = "Schedule for vol-app-dev-create-psv-licence-surrender-task"
      + group_name                   = (known after apply)
      + id                           = (known after apply)
      + name                         = "create-psv-licence-surrender-task-schedule"
      + name_prefix                  = (known after apply)
      + schedule_expression          = "cron(00 02 * * ? *)"
      + schedule_expression_timezone = "UTC"
      + state                        = "ENABLED"

      + flexible_time_window {
          + mode = "OFF"
        }

      + target {
          + arn      = "arn:aws:scheduler:::aws-sdk:batch:submitJob"
          + input    = jsonencode(
                {
                  + JobDefinition = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-create-psv-licence-surrender-task:3"
                  + JobName       = "vol-app-dev-create-psv-licence-surrender-task"
                  + JobQueue      = "arn:aws:batch:eu-west-1:054614622558:job-queue/vol-app-dev-default"
                }
            )
          + role_arn = "arn:aws:iam::054614622558:role/default"
        }
    }

  # module.service.module.eventbridge.aws_scheduler_schedule.this["digital-continuation-reminders"] will be created
  + resource "aws_scheduler_schedule" "this" {
      + arn                          = (known after apply)
      + description                  = "Schedule for vol-app-dev-digital-continuation-reminders"
      + group_name                   = (known after apply)
      + id                           = (known after apply)
      + name                         = "digital-continuation-reminders-schedule"
      + name_prefix                  = (known after apply)
      + schedule_expression          = "cron(00 02 * * ? *)"
      + schedule_expression_timezone = "UTC"
      + state                        = "ENABLED"

      + flexible_time_window {
          + mode = "OFF"
        }

      + target {
          + arn      = "arn:aws:scheduler:::aws-sdk:batch:submitJob"
          + input    = jsonencode(
                {
                  + JobDefinition = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-digital-continuation-reminders:3"
                  + JobName       = "vol-app-dev-digital-continuation-reminders"
                  + JobQueue      = "arn:aws:batch:eu-west-1:054614622558:job-queue/vol-app-dev-default"
                }
            )
          + role_arn = "arn:aws:iam::054614622558:role/default"
        }
    }

  # module.service.module.eventbridge.aws_scheduler_schedule.this["duplicate-vehicle-warning"] will be created
  + resource "aws_scheduler_schedule" "this" {
      + arn                          = (known after apply)
      + description                  = "Schedule for vol-app-dev-duplicate-vehicle-warning"
      + group_name                   = (known after apply)
      + id                           = (known after apply)
      + name                         = "duplicate-vehicle-warning-schedule"
      + name_prefix                  = (known after apply)
      + schedule_expression          = "cron(0 18 ? * 1-5 *)"
      + schedule_expression_timezone = "UTC"
      + state                        = "ENABLED"

      + flexible_time_window {
          + mode = "OFF"
        }

      + target {
          + arn      = "arn:aws:scheduler:::aws-sdk:batch:submitJob"
          + input    = jsonencode(
                {
                  + JobDefinition = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-duplicate-vehicle-warning:3"
                  + JobName       = "vol-app-dev-duplicate-vehicle-warning"
                  + JobQueue      = "arn:aws:batch:eu-west-1:054614622558:job-queue/vol-app-dev-default"
                }
            )
          + role_arn = "arn:aws:iam::054614622558:role/default"
        }
    }

  # module.service.module.eventbridge.aws_scheduler_schedule.this["enqueue-ch-compare"] will be created
  + resource "aws_scheduler_schedule" "this" {
      + arn                          = (known after apply)
      + description                  = "Schedule for vol-app-dev-enqueue-ch-compare"
      + group_name                   = (known after apply)
      + id                           = (known after apply)
      + name                         = "enqueue-ch-compare-schedule"
      + name_prefix                  = (known after apply)
      + schedule_expression          = "cron(0 21 ? * 3 *)"
      + schedule_expression_timezone = "UTC"
      + state                        = "ENABLED"

      + flexible_time_window {
          + mode = "OFF"
        }

      + target {
          + arn      = "arn:aws:scheduler:::aws-sdk:batch:submitJob"
          + input    = jsonencode(
                {
                  + JobDefinition = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-enqueue-ch-compare:3"
                  + JobName       = "vol-app-dev-enqueue-ch-compare"
                  + JobQueue      = "arn:aws:batch:eu-west-1:054614622558:job-queue/vol-app-dev-default"
                }
            )
          + role_arn = "arn:aws:iam::054614622558:role/default"
        }
    }

  # module.service.module.eventbridge.aws_scheduler_schedule.this["expire-bus-registration"] will be created
  + resource "aws_scheduler_schedule" "this" {
      + arn                          = (known after apply)
      + description                  = "Schedule for vol-app-dev-expire-bus-registration"
      + group_name                   = (known after apply)
      + id                           = (known after apply)
      + name                         = "expire-bus-registration-schedule"
      + name_prefix                  = (known after apply)
      + schedule_expression          = "cron(0 21 ? * 3 *)"
      + schedule_expression_timezone = "UTC"
      + state                        = "ENABLED"

      + flexible_time_window {
          + mode = "OFF"
        }

      + target {
          + arn      = "arn:aws:scheduler:::aws-sdk:batch:submitJob"
          + input    = jsonencode(
                {
                  + JobDefinition = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-expire-bus-registration:3"
                  + JobName       = "vol-app-dev-expire-bus-registration"
                  + JobQueue      = "arn:aws:batch:eu-west-1:054614622558:job-queue/vol-app-dev-default"
                }
            )
          + role_arn = "arn:aws:iam::054614622558:role/default"
        }
    }

  # module.service.module.eventbridge.aws_scheduler_schedule.this["flag-urgent-tasks"] will be created
  + resource "aws_scheduler_schedule" "this" {
      + arn                          = (known after apply)
      + description                  = "Schedule for vol-app-dev-flag-urgent-tasks"
      + group_name                   = (known after apply)
      + id                           = (known after apply)
      + name                         = "flag-urgent-tasks-schedule"
      + name_prefix                  = (known after apply)
      + schedule_expression          = "cron(0 * * * ? *)"
      + schedule_expression_timezone = "UTC"
      + state                        = "ENABLED"

      + flexible_time_window {
          + mode = "OFF"
        }

      + target {
          + arn      = "arn:aws:scheduler:::aws-sdk:batch:submitJob"
          + input    = jsonencode(
                {
                  + JobDefinition = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-flag-urgent-tasks:3"
                  + JobName       = "vol-app-dev-flag-urgent-tasks"
                  + JobQueue      = "arn:aws:batch:eu-west-1:054614622558:job-queue/vol-app-dev-default"
                }
            )
          + role_arn = "arn:aws:iam::054614622558:role/default"
        }
    }

  # module.service.module.eventbridge.aws_scheduler_schedule.this["inspection-request-email"] will be created
  + resource "aws_scheduler_schedule" "this" {
      + arn                          = (known after apply)
      + description                  = "Schedule for vol-app-dev-inspection-request-email"
      + group_name                   = (known after apply)
      + id                           = (known after apply)
      + name                         = "inspection-request-email-schedule"
      + name_prefix                  = (known after apply)
      + schedule_expression          = "cron(0 00-04 * * ? *)"
      + schedule_expression_timezone = "UTC"
      + state                        = "ENABLED"

      + flexible_time_window {
          + mode = "OFF"
        }

      + target {
          + arn      = "arn:aws:scheduler:::aws-sdk:batch:submitJob"
          + input    = jsonencode(
                {
                  + JobDefinition = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-inspection-request-email:3"
                  + JobName       = "vol-app-dev-inspection-request-email"
                  + JobQueue      = "arn:aws:batch:eu-west-1:054614622558:job-queue/vol-app-dev-default"
                }
            )
          + role_arn = "arn:aws:iam::054614622558:role/default"
        }
    }

  # module.service.module.eventbridge.aws_scheduler_schedule.this["interim-end-date-enforcement"] will be created
  + resource "aws_scheduler_schedule" "this" {
      + arn                          = (known after apply)
      + description                  = "Schedule for vol-app-dev-interim-end-date-enforcement"
      + group_name                   = (known after apply)
      + id                           = (known after apply)
      + name                         = "interim-end-date-enforcement-schedule"
      + name_prefix                  = (known after apply)
      + schedule_expression          = "cron(00 02 * * ? *)"
      + schedule_expression_timezone = "UTC"
      + state                        = "ENABLED"

      + flexible_time_window {
          + mode = "OFF"
        }

      + target {
          + arn      = "arn:aws:scheduler:::aws-sdk:batch:submitJob"
          + input    = jsonencode(
                {
                  + JobDefinition = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-interim-end-date-enforcement:3"
                  + JobName       = "vol-app-dev-interim-end-date-enforcement"
                  + JobQueue      = "arn:aws:batch:eu-west-1:054614622558:job-queue/vol-app-dev-default"
                }
            )
          + role_arn = "arn:aws:iam::054614622558:role/default"
        }
    }

  # module.service.module.eventbridge.aws_scheduler_schedule.this["international-goods-export"] will be created
  + resource "aws_scheduler_schedule" "this" {
      + arn                          = (known after apply)
      + description                  = "Schedule for vol-app-dev-international-goods-export"
      + group_name                   = (known after apply)
      + id                           = (known after apply)
      + name                         = "international-goods-export-schedule"
      + name_prefix                  = (known after apply)
      + schedule_expression          = "cron(00 02 ? * 7 *)"
      + schedule_expression_timezone = "UTC"
      + state                        = "ENABLED"

      + flexible_time_window {
          + mode = "OFF"
        }

      + target {
          + arn      = "arn:aws:scheduler:::aws-sdk:batch:submitJob"
          + input    = jsonencode(
                {
                  + JobDefinition = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-international-goods-export:3"
                  + JobName       = "vol-app-dev-international-goods-export"
                  + JobQueue      = "arn:aws:batch:eu-west-1:054614622558:job-queue/vol-app-dev-default"
                }
            )
          + role_arn = "arn:aws:iam::054614622558:role/default"
        }
    }

  # module.service.module.eventbridge.aws_scheduler_schedule.this["last-tm-letter"] will be created
  + resource "aws_scheduler_schedule" "this" {
      + arn                          = (known after apply)
      + description                  = "Schedule for vol-app-dev-last-tm-letter"
      + group_name                   = (known after apply)
      + id                           = (known after apply)
      + name                         = "last-tm-letter-schedule"
      + name_prefix                  = (known after apply)
      + schedule_expression          = "cron(30 06 * * ? *)"
      + schedule_expression_timezone = "UTC"
      + state                        = "ENABLED"

      + flexible_time_window {
          + mode = "OFF"
        }

      + target {
          + arn      = "arn:aws:scheduler:::aws-sdk:batch:submitJob"
          + input    = jsonencode(
                {
                  + JobDefinition = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-last-tm-letter:3"
                  + JobName       = "vol-app-dev-last-tm-letter"
                  + JobQueue      = "arn:aws:batch:eu-west-1:054614622558:job-queue/vol-app-dev-default"
                }
            )
          + role_arn = "arn:aws:iam::054614622558:role/default"
        }
    }

  # module.service.module.eventbridge.aws_scheduler_schedule.this["licence-status-rules"] will be created
  + resource "aws_scheduler_schedule" "this" {
      + arn                          = (known after apply)
      + description                  = "Schedule for vol-app-dev-licence-status-rules"
      + group_name                   = (known after apply)
      + id                           = (known after apply)
      + name                         = "licence-status-rules-schedule"
      + name_prefix                  = (known after apply)
      + schedule_expression          = "cron(0 * * * ? *)"
      + schedule_expression_timezone = "UTC"
      + state                        = "ENABLED"

      + flexible_time_window {
          + mode = "OFF"
        }

      + target {
          + arn      = "arn:aws:scheduler:::aws-sdk:batch:submitJob"
          + input    = jsonencode(
                {
                  + JobDefinition = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-licence-status-rules:3"
                  + JobName       = "vol-app-dev-licence-status-rules"
                  + JobQueue      = "arn:aws:batch:eu-west-1:054614622558:job-queue/vol-app-dev-default"
                }
            )
          + role_arn = "arn:aws:iam::054614622558:role/default"
        }
    }

  # module.service.module.eventbridge.aws_scheduler_schedule.this["mark-expired-permits"] will be created
  + resource "aws_scheduler_schedule" "this" {
      + arn                          = (known after apply)
      + description                  = "Schedule for vol-app-dev-mark-expired-permits"
      + group_name                   = (known after apply)
      + id                           = (known after apply)
      + name                         = "mark-expired-permits-schedule"
      + name_prefix                  = (known after apply)
      + schedule_expression          = "cron(15 06 * * ? *)"
      + schedule_expression_timezone = "UTC"
      + state                        = "ENABLED"

      + flexible_time_window {
          + mode = "OFF"
        }

      + target {
          + arn      = "arn:aws:scheduler:::aws-sdk:batch:submitJob"
          + input    = jsonencode(
                {
                  + JobDefinition = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-mark-expired-permits:3"
                  + JobName       = "vol-app-dev-mark-expired-permits"
                  + JobQueue      = "arn:aws:batch:eu-west-1:054614622558:job-queue/vol-app-dev-default"
                }
            )
          + role_arn = "arn:aws:iam::054614622558:role/default"
        }
    }

  # module.service.module.eventbridge.aws_scheduler_schedule.this["process-company-profile"] will be created
  + resource "aws_scheduler_schedule" "this" {
      + arn                          = (known after apply)
      + description                  = "Schedule for vol-app-dev-process-company-profile"
      + group_name                   = (known after apply)
      + id                           = (known after apply)
      + name                         = "process-company-profile-schedule"
      + name_prefix                  = (known after apply)
      + schedule_expression          = "cron(0/5 * * * ? *)"
      + schedule_expression_timezone = "UTC"
      + state                        = "ENABLED"

      + flexible_time_window {
          + mode = "OFF"
        }

      + target {
          + arn      = "arn:aws:scheduler:::aws-sdk:batch:submitJob"
          + input    = jsonencode(
                {
                  + JobDefinition = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-process-company-profile:3"
                  + JobName       = "vol-app-dev-process-company-profile"
                  + JobQueue      = "arn:aws:batch:eu-west-1:054614622558:job-queue/vol-app-dev-default"
                }
            )
          + role_arn = "arn:aws:iam::054614622558:role/default"
        }
    }

  # module.service.module.eventbridge.aws_scheduler_schedule.this["process-inbox"] will be created
  + resource "aws_scheduler_schedule" "this" {
      + arn                          = (known after apply)
      + description                  = "Schedule for vol-app-dev-process-inbox"
      + group_name                   = (known after apply)
      + id                           = (known after apply)
      + name                         = "process-inbox-schedule"
      + name_prefix                  = (known after apply)
      + schedule_expression          = "cron(45 01 * ? *)"
      + schedule_expression_timezone = "UTC"
      + state                        = "ENABLED"

      + flexible_time_window {
          + mode = "OFF"
        }

      + target {
          + arn      = "arn:aws:scheduler:::aws-sdk:batch:submitJob"
          + input    = jsonencode(
                {
                  + JobDefinition = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-process-inbox:3"
                  + JobName       = "vol-app-dev-process-inbox"
                  + JobQueue      = "arn:aws:batch:eu-west-1:054614622558:job-queue/vol-app-dev-default"
                }
            )
          + role_arn = "arn:aws:iam::054614622558:role/default"
        }
    }

  # module.service.module.eventbridge.aws_scheduler_schedule.this["process-insolvency"] will be created
  + resource "aws_scheduler_schedule" "this" {
      + arn                          = (known after apply)
      + description                  = "Schedule for vol-app-dev-process-insolvency"
      + group_name                   = (known after apply)
      + id                           = (known after apply)
      + name                         = "process-insolvency-schedule"
      + name_prefix                  = (known after apply)
      + schedule_expression          = "cron(0/30 * * * ? *)"
      + schedule_expression_timezone = "UTC"
      + state                        = "ENABLED"

      + flexible_time_window {
          + mode = "OFF"
        }

      + target {
          + arn      = "arn:aws:scheduler:::aws-sdk:batch:submitJob"
          + input    = jsonencode(
                {
                  + JobDefinition = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-process-insolvency:3"
                  + JobName       = "vol-app-dev-process-insolvency"
                  + JobQueue      = "arn:aws:batch:eu-west-1:054614622558:job-queue/vol-app-dev-default"
                }
            )
          + role_arn = "arn:aws:iam::054614622558:role/default"
        }
    }

  # module.service.module.eventbridge.aws_scheduler_schedule.this["process-insolvency-dlq"] will be created
  + resource "aws_scheduler_schedule" "this" {
      + arn                          = (known after apply)
      + description                  = "Schedule for vol-app-dev-process-insolvency-dlq"
      + group_name                   = (known after apply)
      + id                           = (known after apply)
      + name                         = "process-insolvency-dlq-schedule"
      + name_prefix                  = (known after apply)
      + schedule_expression          = "cron(0/30 * * * ? *)"
      + schedule_expression_timezone = "UTC"
      + state                        = "ENABLED"

      + flexible_time_window {
          + mode = "OFF"
        }

      + target {
          + arn      = "arn:aws:scheduler:::aws-sdk:batch:submitJob"
          + input    = jsonencode(
                {
                  + JobDefinition = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-process-insolvency-dlq:3"
                  + JobName       = "vol-app-dev-process-insolvency-dlq"
                  + JobQueue      = "arn:aws:batch:eu-west-1:054614622558:job-queue/vol-app-dev-default"
                }
            )
          + role_arn = "arn:aws:iam::054614622558:role/default"
        }
    }

  # module.service.module.eventbridge.aws_scheduler_schedule.this["process-ntu"] will be created
  + resource "aws_scheduler_schedule" "this" {
      + arn                          = (known after apply)
      + description                  = "Schedule for vol-app-dev-process-ntu"
      + group_name                   = (known after apply)
      + id                           = (known after apply)
      + name                         = "process-ntu-schedule"
      + name_prefix                  = (known after apply)
      + schedule_expression          = "cron(45 01 * ? *)"
      + schedule_expression_timezone = "UTC"
      + state                        = "ENABLED"

      + flexible_time_window {
          + mode = "OFF"
        }

      + target {
          + arn      = "arn:aws:scheduler:::aws-sdk:batch:submitJob"
          + input    = jsonencode(
                {
                  + JobDefinition = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-process-ntu:3"
                  + JobName       = "vol-app-dev-process-ntu"
                  + JobQueue      = "arn:aws:batch:eu-west-1:054614622558:job-queue/vol-app-dev-default"
                }
            )
          + role_arn = "arn:aws:iam::054614622558:role/default"
        }
    }

  # module.service.module.eventbridge.aws_scheduler_schedule.this["process-queue-community-licences"] will be created
  + resource "aws_scheduler_schedule" "this" {
      + arn                          = (known after apply)
      + description                  = "Schedule for vol-app-dev-process-queue-community-licences"
      + group_name                   = (known after apply)
      + id                           = (known after apply)
      + name                         = "process-queue-community-licences-schedule"
      + name_prefix                  = (known after apply)
      + schedule_expression          = "cron(0/2 * * * ? *)"
      + schedule_expression_timezone = "UTC"
      + state                        = "ENABLED"

      + flexible_time_window {
          + mode = "OFF"
        }

      + target {
          + arn      = "arn:aws:scheduler:::aws-sdk:batch:submitJob"
          + input    = jsonencode(
                {
                  + JobDefinition = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-process-queue-community-licences:3"
                  + JobName       = "vol-app-dev-process-queue-community-licences"
                  + JobQueue      = "arn:aws:batch:eu-west-1:054614622558:job-queue/vol-app-dev-default"
                }
            )
          + role_arn = "arn:aws:iam::054614622558:role/default"
        }
    }

  # module.service.module.eventbridge.aws_scheduler_schedule.this["process-queue-disc-generation"] will be created
  + resource "aws_scheduler_schedule" "this" {
      + arn                          = (known after apply)
      + description                  = "Schedule for vol-app-dev-process-queue-disc-generation"
      + group_name                   = (known after apply)
      + id                           = (known after apply)
      + name                         = "process-queue-disc-generation-schedule"
      + name_prefix                  = (known after apply)
      + schedule_expression          = "cron(0/2 * * * ? *)"
      + schedule_expression_timezone = "UTC"
      + state                        = "ENABLED"

      + flexible_time_window {
          + mode = "OFF"
        }

      + target {
          + arn      = "arn:aws:scheduler:::aws-sdk:batch:submitJob"
          + input    = jsonencode(
                {
                  + JobDefinition = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-process-queue-disc-generation:3"
                  + JobName       = "vol-app-dev-process-queue-disc-generation"
                  + JobQueue      = "arn:aws:batch:eu-west-1:054614622558:job-queue/vol-app-dev-default"
                }
            )
          + role_arn = "arn:aws:iam::054614622558:role/default"
        }
    }

  # module.service.module.eventbridge.aws_scheduler_schedule.this["process-queue-disc-print"] will be created
  + resource "aws_scheduler_schedule" "this" {
      + arn                          = (known after apply)
      + description                  = "Schedule for vol-app-dev-process-queue-disc-print"
      + group_name                   = (known after apply)
      + id                           = (known after apply)
      + name                         = "process-queue-disc-print-schedule"
      + name_prefix                  = (known after apply)
      + schedule_expression          = "cron(0/15 * * * ? *)"
      + schedule_expression_timezone = "UTC"
      + state                        = "ENABLED"

      + flexible_time_window {
          + mode = "OFF"
        }

      + target {
          + arn      = "arn:aws:scheduler:::aws-sdk:batch:submitJob"
          + input    = jsonencode(
                {
                  + JobDefinition = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-process-queue-disc-print:3"
                  + JobName       = "vol-app-dev-process-queue-disc-print"
                  + JobQueue      = "arn:aws:batch:eu-west-1:054614622558:job-queue/vol-app-dev-default"
                }
            )
          + role_arn = "arn:aws:iam::054614622558:role/default"
        }
    }

  # module.service.module.eventbridge.aws_scheduler_schedule.this["process-queue-ecmt-accept"] will be created
  + resource "aws_scheduler_schedule" "this" {
      + arn                          = (known after apply)
      + description                  = "Schedule for vol-app-dev-process-queue-ecmt-accept"
      + group_name                   = (known after apply)
      + id                           = (known after apply)
      + name                         = "process-queue-ecmt-accept-schedule"
      + name_prefix                  = (known after apply)
      + schedule_expression          = "cron(0/2 * * * ? *)"
      + schedule_expression_timezone = "UTC"
      + state                        = "ENABLED"

      + flexible_time_window {
          + mode = "OFF"
        }

      + target {
          + arn      = "arn:aws:scheduler:::aws-sdk:batch:submitJob"
          + input    = jsonencode(
                {
                  + JobDefinition = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-process-queue-ecmt-accept:3"
                  + JobName       = "vol-app-dev-process-queue-ecmt-accept"
                  + JobQueue      = "arn:aws:batch:eu-west-1:054614622558:job-queue/vol-app-dev-default"
                }
            )
          + role_arn = "arn:aws:iam::054614622558:role/default"
        }
    }

  # module.service.module.eventbridge.aws_scheduler_schedule.this["process-queue-general"] will be created
  + resource "aws_scheduler_schedule" "this" {
      + arn                          = (known after apply)
      + description                  = "Schedule for vol-app-dev-process-queue-general"
      + group_name                   = (known after apply)
      + id                           = (known after apply)
      + name                         = "process-queue-general-schedule"
      + name_prefix                  = (known after apply)
      + schedule_expression          = "cron(0/2 * * * ? *)"
      + schedule_expression_timezone = "UTC"
      + state                        = "ENABLED"

      + flexible_time_window {
          + mode = "OFF"
        }

      + target {
          + arn      = "arn:aws:scheduler:::aws-sdk:batch:submitJob"
          + input    = jsonencode(
                {
                  + JobDefinition = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-process-queue-general:3"
                  + JobName       = "vol-app-dev-process-queue-general"
                  + JobQueue      = "arn:aws:batch:eu-west-1:054614622558:job-queue/vol-app-dev-default"
                }
            )
          + role_arn = "arn:aws:iam::054614622558:role/default"
        }
    }

  # module.service.module.eventbridge.aws_scheduler_schedule.this["process-queue-irhp-allocate"] will be created
  + resource "aws_scheduler_schedule" "this" {
      + arn                          = (known after apply)
      + description                  = "Schedule for vol-app-dev-process-queue-irhp-allocate"
      + group_name                   = (known after apply)
      + id                           = (known after apply)
      + name                         = "process-queue-irhp-allocate-schedule"
      + name_prefix                  = (known after apply)
      + schedule_expression          = "cron(0/2 * * * ? *)"
      + schedule_expression_timezone = "UTC"
      + state                        = "ENABLED"

      + flexible_time_window {
          + mode = "OFF"
        }

      + target {
          + arn      = "arn:aws:scheduler:::aws-sdk:batch:submitJob"
          + input    = jsonencode(
                {
                  + JobDefinition = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-process-queue-irhp-allocate:3"
                  + JobName       = "vol-app-dev-process-queue-irhp-allocate"
                  + JobQueue      = "arn:aws:batch:eu-west-1:054614622558:job-queue/vol-app-dev-default"
                }
            )
          + role_arn = "arn:aws:iam::054614622558:role/default"
        }
    }

  # module.service.module.eventbridge.aws_scheduler_schedule.this["process-queue-permit-generation"] will be created
  + resource "aws_scheduler_schedule" "this" {
      + arn                          = (known after apply)
      + description                  = "Schedule for vol-app-dev-process-queue-permit-generation"
      + group_name                   = (known after apply)
      + id                           = (known after apply)
      + name                         = "process-queue-permit-generation-schedule"
      + name_prefix                  = (known after apply)
      + schedule_expression          = "cron(0/2 * * * ? *)"
      + schedule_expression_timezone = "UTC"
      + state                        = "ENABLED"

      + flexible_time_window {
          + mode = "OFF"
        }

      + target {
          + arn      = "arn:aws:scheduler:::aws-sdk:batch:submitJob"
          + input    = jsonencode(
                {
                  + JobDefinition = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-process-queue-permit-generation:3"
                  + JobName       = "vol-app-dev-process-queue-permit-generation"
                  + JobQueue      = "arn:aws:batch:eu-west-1:054614622558:job-queue/vol-app-dev-default"
                }
            )
          + role_arn = "arn:aws:iam::054614622558:role/default"
        }
    }

  # module.service.module.eventbridge.aws_scheduler_schedule.this["process-queue-permit-print"] will be created
  + resource "aws_scheduler_schedule" "this" {
      + arn                          = (known after apply)
      + description                  = "Schedule for vol-app-dev-process-queue-permit-print"
      + group_name                   = (known after apply)
      + id                           = (known after apply)
      + name                         = "process-queue-permit-print-schedule"
      + name_prefix                  = (known after apply)
      + schedule_expression          = "cron(0/15 * * * ? *)"
      + schedule_expression_timezone = "UTC"
      + state                        = "ENABLED"

      + flexible_time_window {
          + mode = "OFF"
        }

      + target {
          + arn      = "arn:aws:scheduler:::aws-sdk:batch:submitJob"
          + input    = jsonencode(
                {
                  + JobDefinition = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-process-queue-permit-print:3"
                  + JobName       = "vol-app-dev-process-queue-permit-print"
                  + JobQueue      = "arn:aws:batch:eu-west-1:054614622558:job-queue/vol-app-dev-default"
                }
            )
          + role_arn = "arn:aws:iam::054614622558:role/default"
        }
    }

  # module.service.module.eventbridge.aws_scheduler_schedule.this["process-queue-print"] will be created
  + resource "aws_scheduler_schedule" "this" {
      + arn                          = (known after apply)
      + description                  = "Schedule for vol-app-dev-process-queue-print"
      + group_name                   = (known after apply)
      + id                           = (known after apply)
      + name                         = "process-queue-print-schedule"
      + name_prefix                  = (known after apply)
      + schedule_expression          = "cron(0/2 * * * ? *)"
      + schedule_expression_timezone = "UTC"
      + state                        = "ENABLED"

      + flexible_time_window {
          + mode = "OFF"
        }

      + target {
          + arn      = "arn:aws:scheduler:::aws-sdk:batch:submitJob"
          + input    = jsonencode(
                {
                  + JobDefinition = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-process-queue-print:3"
                  + JobName       = "vol-app-dev-process-queue-print"
                  + JobQueue      = "arn:aws:batch:eu-west-1:054614622558:job-queue/vol-app-dev-default"
                }
            )
          + role_arn = "arn:aws:iam::054614622558:role/default"
        }
    }

  # module.service.module.eventbridge.aws_scheduler_schedule.this["psv-operator-list-export"] will be created
  + resource "aws_scheduler_schedule" "this" {
      + arn                          = (known after apply)
      + description                  = "Schedule for vol-app-dev-psv-operator-list-export"
      + group_name                   = (known after apply)
      + id                           = (known after apply)
      + name                         = "psv-operator-list-export-schedule"
      + name_prefix                  = (known after apply)
      + schedule_expression          = "cron(00 02 ? * 7 *)"
      + schedule_expression_timezone = "UTC"
      + state                        = "ENABLED"

      + flexible_time_window {
          + mode = "OFF"
        }

      + target {
          + arn      = "arn:aws:scheduler:::aws-sdk:batch:submitJob"
          + input    = jsonencode(
                {
                  + JobDefinition = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-psv-operator-list-export:3"
                  + JobName       = "vol-app-dev-psv-operator-list-export"
                  + JobQueue      = "arn:aws:batch:eu-west-1:054614622558:job-queue/vol-app-dev-default"
                }
            )
          + role_arn = "arn:aws:iam::054614622558:role/default"
        }
    }

  # module.service.module.eventbridge.aws_scheduler_schedule.this["remove-read-audit"] will be created
  + resource "aws_scheduler_schedule" "this" {
      + arn                          = (known after apply)
      + description                  = "Schedule for vol-app-dev-remove-read-audit"
      + group_name                   = (known after apply)
      + id                           = (known after apply)
      + name                         = "remove-read-audit-schedule"
      + name_prefix                  = (known after apply)
      + schedule_expression          = "cron(0 22 ? * 7 *)"
      + schedule_expression_timezone = "UTC"
      + state                        = "ENABLED"

      + flexible_time_window {
          + mode = "OFF"
        }

      + target {
          + arn      = "arn:aws:scheduler:::aws-sdk:batch:submitJob"
          + input    = jsonencode(
                {
                  + JobDefinition = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-remove-read-audit:3"
                  + JobName       = "vol-app-dev-remove-read-audit"
                  + JobQueue      = "arn:aws:batch:eu-west-1:054614622558:job-queue/vol-app-dev-default"
                }
            )
          + role_arn = "arn:aws:iam::054614622558:role/default"
        }
    }

  # module.service.module.eventbridge.aws_scheduler_schedule.this["resolve-payments"] will be created
  + resource "aws_scheduler_schedule" "this" {
      + arn                          = (known after apply)
      + description                  = "Schedule for vol-app-dev-resolve-payments"
      + group_name                   = (known after apply)
      + id                           = (known after apply)
      + name                         = "resolve-payments-schedule"
      + name_prefix                  = (known after apply)
      + schedule_expression          = "cron(0/5 * * * ? *)"
      + schedule_expression_timezone = "UTC"
      + state                        = "ENABLED"

      + flexible_time_window {
          + mode = "OFF"
        }

      + target {
          + arn      = "arn:aws:scheduler:::aws-sdk:batch:submitJob"
          + input    = jsonencode(
                {
                  + JobDefinition = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-resolve-payments:3"
                  + JobName       = "vol-app-dev-resolve-payments"
                  + JobQueue      = "arn:aws:batch:eu-west-1:054614622558:job-queue/vol-app-dev-default"
                }
            )
          + role_arn = "arn:aws:iam::054614622558:role/default"
        }
    }

  # module.service.module.eventbridge.aws_scheduler_schedule.this["transxchange-consumer"] will be created
  + resource "aws_scheduler_schedule" "this" {
      + arn                          = (known after apply)
      + description                  = "Schedule for vol-app-dev-transxchange-consumer"
      + group_name                   = (known after apply)
      + id                           = (known after apply)
      + name                         = "transxchange-consumer-schedule"
      + name_prefix                  = (known after apply)
      + schedule_expression          = "cron(0/2 * * * ? *)"
      + schedule_expression_timezone = "UTC"
      + state                        = "ENABLED"

      + flexible_time_window {
          + mode = "OFF"
        }

      + target {
          + arn      = "arn:aws:scheduler:::aws-sdk:batch:submitJob"
          + input    = jsonencode(
                {
                  + JobDefinition = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-transxchange-consumer:3"
                  + JobName       = "vol-app-dev-transxchange-consumer"
                  + JobQueue      = "arn:aws:batch:eu-west-1:054614622558:job-queue/vol-app-dev-default"
                }
            )
          + role_arn = "arn:aws:iam::054614622558:role/default"
        }
    }

Plan: 34 to add, 0 to change, 0 to destroy.

```

</details>